⊕ [zip() in Python - GeeksforGeeks](https://www.geeksforgeeks.org/zip-in-python/)

⊕ [Create pandas dataframe from lists using zip - GeeksforGeeks](https://www.geeksforgeeks.org/create-pandas-dataframe-from-lists-using-zip/)

In [9]:
# initializing lists 
name = [ "Manjeet", "Nikhil", "Shambhavi", "Astha" ] 
roll_no = [ 4, 1, 3, 2 ] 
marks = [ 40, 50, 60, 70 ] 
  
# using zip() to map values 
mapped = zip(name, roll_no, marks) 
  
# converting values to print as set 
mapped = set(mapped) 
  
# printing resultant values  
print ("The zipped result is : ",end="") 
print (mapped)

The zipped result is : {('Nikhil', 1, 50), ('Shambhavi', 3, 60), ('Astha', 2, 70), ('Manjeet', 4, 40)}

In [2]:
import pandas as pd 
  
# List1 
Name = ['tom', 'krish', 'nick', 'juli'] 
  
# List2 
Age = [25, 30, 26, 22] 
  
# get the list of tuples from two lists. 
# and merge them by using zip(). 
list_of_tuples = list(zip(Name, Age)) 
  
# Assign data to tuples. 
list_of_tuples

[('tom', 25), ('krish', 30), ('nick', 26), ('juli', 22)]

In [4]:
# Converting lists of tuples into 
# pandas Dataframe. 
df = pd.DataFrame(list_of_tuples, columns = ['Name', 'Age']) 
   
# Print data. 
df

    Name  Age
0    tom   25
1  krish   30
2   nick   26
3   juli   22

In [5]:
df = pd.DataFrame(list(mapped), columns = ['name', 'roll', 'marks']) 
df

        name  roll  marks
0     Nikhil     1     50
1  Shambhavi     3     60
2      Astha     2     70
3    Manjeet     4     40

In [10]:
def to_df(*iterators):
    mapped = zip(*iterators)
    df = pd.DataFrame(list(mapped), columns = ['name', 'roll', 'marks']) 
    return df 

to_df(name, roll_no, marks)

        name  roll  marks
0    Manjeet     4     40
1     Nikhil     1     50
2  Shambhavi     3     60
3      Astha     2     70

In [8]:
# importing pandas as pd 
import pandas as pd 
  
# dictionary of lists 
dict = {'name':["aparna", "pankaj", "sudhir", "Geeku"], 
        'degree': ["MBA", "BCA", "M.Tech", "MBA"], 
        'score':[90, 40, 80, 98]} 
  
df = pd.DataFrame(dict) 
  
df

   degree    name  score
0     MBA  aparna     90
1     BCA  pankaj     40
2  M.Tech  sudhir     80
3     MBA   Geeku     98